Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: If you delete all languages, %1$s will download partial languages to your cache as you translate.
am: ሁሉንም ቋንቋዎች ከሰረዙ፣ ሲተረጉሙ %1$s ከፊል ቋንቋዎችን ወደ መሸጎጫዎ ያወርዳል።

source: If you delete this language, %1$s will download partial languages to your cache as you translate.
am: ይህን ቋንቋ ከሰረዙት፣ ሲተረጉሙ %1$s ከፊል ቋንቋዎችን ወደ መሸጎጫዎ ያወርዳል።

source: If you see this product is back in stock, report it and we’ll work on checking the reviews.
am: ይህ ምርት ወደ ክምችት እንደተመለሰ ካዩ፣ ሪፖርት ያድርጉት እና ግምገማዎቹን ለማየት እንሰራለን።

source: If you trust this extension, you can give it permission on every website.
am: ይህን ቅጥያ የሚያምኑት ከሆነ በእያንዳንዱ ድር ጣቢያ ላይ ፈቃድ ሊሰጡት ይችላሉ።

source: Image copied to clipboard
am: ምስል ወደ ቅንጥብ ሰሌዳ ተቀድቷል

source: Image of the %1$s theme
am: የ%1$s ገጽታ ምስል

source: Image of the %1$s toolbar
am: የ%1$s መሣሪያ አሞሌ ምስል

source: Image of the bottom toolbar
am: የታችኛው የመሳሪያ አሞሌ ምስል

source: Image of the top toolbar
am: የላይኛው የመሳሪያ አሞሌ ምስል

source: Images
am: ምስሎች

source: Images or videos
am: ምስሎች ወይም ተንቀሳቃሽ-ምስሎች

source: I’m having issues
am: ችግሮች እያጋጠሙኝ ነው

source: in %1$s
am: በ%1$s ውስጥ

source: Inactive
am: እንቅስቃሴ-አልባ

source: Inactive tabs
am: የቦዘኑ ትሮች

source: In all tabs
am: በሁሉም ትሮች ውስጥ

source: Include %1$s download link on WhatsApp shares
am: በWhatsApp ማጋራቶች ላይ %1$s የማውረድ አገናኝ ያካትቱ

source: Include information like numbers, email and shipping addresses
am: እንደ ቁጥሮች፣ ኢሜይል እና የመላኪያ አድራሻዎች ያሉ መረጃዎችን ያካትቱ

source: Includes phone numbers and email addresses
am: ስልክ ቁጥሮች እና የኢሜይል አድራሻዎችን ያካትታል

source: Increased Protection
am: ጥበቃ መጨመር

source: Info
am: መረጃ

source: Info coming soon
am: መረጃ በቅርቡ ይመጣል

source: In progress
am: በሂደት ላይ

source: Input data to the clipboard
am: ውሂብ ወደ ቅንጥብ ሰሌዳው ያስገቡ

source: Install
am: ጫን

source: Install %1$s
am: %1$sን ጫን

source: Install Add-on
am: ተጨማሪን ጫን

source: Install add-on from file
am: ተጨማሪውን ከፋይል ጫን

source: Install and run studies
am: ጥናቶችን ይጫኑ እና ያሂዱ

source: Installed
am: ተጭኗል

source: Installed add-on icon
am: የተጫነ ተጨማሪ አዶ

source: Install extension from file
am: ቅጥያውን ከፋይል ጫን

source: Installing add-on icon
am: የተጨማሪ አዶን በመጫን ላይ

source: Install search widget
am: የፍለጋ መግብርን ጫን

source: Invalid Address
am: ልክ ያልሆነ አድራሻ

source: Invalid URL
am: ልክ ያልሆነ URL

source: Invite your friends to try faster, safer browsing with %1$s every time you share a link on WhatsApp.
am: በWhatsApp ላይ አገናኝ ባጋሩ ቁጥር ጓደኞችዎን ፈጣኑን እና ደህንነቱ የተጠበቀ አሰሳ በ%1$s እንዲሞክሩ ይጋብዙ።

source: Isolate cross-site cookies
am: ድረ-ገጽ ተሻጋሪ ኩኪዎችን ለይ

source: Item Menu for %s
am: የንጥል ምናሌ ለ%s

source: Items deleted: %1$d
am: እቃዎች ተሰርዘዋል፡ %1$d

source: It requires your permission to:
am: የሚከተለውን ለማድረግ የእርስዎን ፈቃድ ይፈልጋል፦

source: It’s great!
am: በጣም ጥሩ ነው!

source: It wants to:
am: ይፈልጋል፡-

source: Jan
am: ጥር

source: Jul
am: ሐም

source: Jump back in
am: መልሰው ይዝለሉ

source: Jun
am: ሰኔ

source: Keep it on the bottom, or move it to the top.
am: ከታች ያስቀምጡት, ወይም ወደ ላይ ያንቀሳቅሱት።

source: Keep searches within reach.
am: ፍለጋዎችን በሚደረስበት ቦታ ያቆዩ።

source: Keep your data to yourself. %s protects you from many of the most common trackers that follow what you do online.
am: ውሂብዎን ለራስዎ ያስቀምጡ። %s በመስመር ላይ የሚያደርጉትን ከሚከተሉ ብዙ በጣም የተለመዱ መከታተያዎች ይጠብቅዎታል።

source: Known Fingerprinters
am: የታወቁ የጣት አሻራ ሰብሳቢዎች

source: Known trackers? Blocked automatically. Extensions? Try all 700. PDFs? Our built-in reader makes them easy to manage.
am: የታወቁ መከታተያዎች? በራስ ሰር ታግደዋል። ቅጥያዎች? ሁሉንም ይሞክሩ 700. ፒዲኤፍ? የእኛ አብሮ-የተገነባ አንባቢ ለማስተዳደር ቀላል ያደርጋቸዋል።

source: Know your rights
am: መብቶትን ይወቁ

source: <label> <b>%1$s</b> has a security policy called HTTP Strict Transport Security (HSTS), which means that <b>%2$s</b> can only connect to it securely. You can’t add an exception to visit this site.
am: <label> <b>%1$s</b> HTTP Strict Transport Security (HSTS) የሚባል የደህንነት ፖሊሲ አለው፣ ይህ ማለት <b>%2$s</b> ደህንነቱ በተጠበቀ ሁኔታ ብቻ ነው መገናኘት የሚችለው። ይህንን ድረ-ገጽ ለመጎብኘት የተለየ ፈቃድ ማከል አይችሉም።

source: <label> <b>%1$s</b> has a security policy called HTTP Strict Transport Security (HSTS), which means that <b>%2$s</b> can only connect to it securely. You can’t add an exception to visit this site. </label>
am: <label> <b>%1$s</b> HTTP Strict Transport Security (HSTS) የሚባል የደህንነት ፖሊሲ አለው፣ ይህ ማለት <b>%2$s</b> ደህንነቱ በተጠበቀ ሁኔታ ብቻ ነው መገናኘት የሚችለው። ይህንን ድረ-ገጽ ለመጎብኘት የተለየ ፈቃድ ማከል አይችሉም። </label>

source: Label for entering a text input field
am: የጽሑፍ ግብዓት መስክ ለማስገባት መለያ

source: <label>Someone could be trying to impersonate the site and you should not continue.</label> <br><br> <label>Websites prove their identity via certificates. %1$s does not trust <b>%2$s</b> because its certificate issuer is unknown, the certificate is self-signed, or the server is not sending the correct intermediate certificates.</label>
am: <label>አንድ ሰው ድረ-ገፁን ለማስመሰል እየሞከረ ሊሆን ይችላል እና እርስዎ መቀጠል የለብዎትም።</label> <br><br> <label>ድረ-ገፆች ማንነታቸውን በእውቅና ማረጋገጫዎች ያረጋግጣሉ። %1$s <b>%2$s</b>ን አያምንም ምክንያቱም የእውቅና ማረጋገጫ ሰጪው ስለማይታወቅ፣ የእውቅና ማረጋገጫው በራሱ የተፈረመ ነው ወይም አገልጋዩ ትክክለኛ መካከለኛ የእውቅና ማረጋገጫዎችን እየላከ አይደለም።</label>

source: Large header image of the theme selection view showing illustrated artist and builder tools.
am: የገጽታ ምርጫ እይታ ትልቅ የራስጌ ምስል ሥዕላዊ አርቲስት እና ገንቢ መሳሪያዎችን ያሳያል።

source: Large header image of the toolbar selection view showing an illustrated toolbar.
am: የምስል አሞሌን የሚያሳይ ትልቅ የራስጌ ምስል የመሳሪያ አሞሌ ምርጫ እይታ።

source: Last 30 days
am: ባለፉት 30 ቀናት

source: Last 7 days
am: ያለፉት 7 ቀናት

source: Last attempt:
am: የመጨረሻ ሙከራ፡-

source: Last chance to keep your Firefox
am: የእርስዎን Firefox ለማቆየት የመጨረሻው ዕድል

source: Last hour
am: የመጨረሻው ሰዓት

source: Last Name
am: የአያት ስም

source: Last synced: never
am: መጨረሻ የተመሳሰለው፡- በጭራሽ

source: Last synced: %s
am: መጨረሻ የተመሳሰለው፡- %s

source: Last tab
am: የመጨረሻው ትር

source: Last updated
am: መጨረሻ የተሻሻለው

source: Last used
am: ለመጨረሻ ጊዜ ጥቅም ላይ የዋለ

source: Later
am: በኋላ

source: Launch next private tab in one tap.
am: አንዴ መታ በማድረግ ቀጣዩን የግል ትር አስጀምር።

source: Launch your next private tab in one tap.
am: አንዴ መታ በማድረግ ቀጣዩን የግል ትር አስጀምር።

source: Learn About Sending Tabs…
am: ትሮችን ስለመላክ ይወቁ…

source: Learn about Total Cookie Protection
am: ስለ አጠቃላይ የኩኪ ጥበቃ ይወቁ

source: Learn more about crash reports
am: ስለብልሽት ሪፖርቶች የበለጠ ይረዱ

source: Learn more about daily usage ping
am: ስለ ዕለታዊ አጠቃቀም ደወል የበለጠ ይረዱ

source: Learn more about Firefox Suggest
am: ስለFirefox Suggest የበለጠ ይወቁ

source: Learn more about marketing data
am: ስለ ግብይት ውሂብ የበለጠ ይወቁ

source: Learn more about permissions
am: ስለ ፈቃዶች ተጨማሪ ይወቁ

source: Learn more about %s.
am: ስለ%s የበለጠ ይወቁ።

source: Learn more about sync
am: ስለ ማሰናሰል የበለጠ ይረዱ

source: Learn more about Sync.
am: ስለ ማመሳሰል የበለጠ ይረዱ።

source: Learn more about technical data
am: ስለ ቴክኒካዊ ውሂብ የበለጠ ይወቁ

source: Learn more about usage data
am: ስለአጠቃቀም ውሂብ የበለጠ ይወቁ

source: Learn more in our privacy notice
am: በእኛ የግላዊነት ማስታወቂያ ውስጥ የበለጠ ይረዱ

source: Leave
am: ውጣ

source: Leave feedback
am: አስተያየት ይተው

source: Leave no traces on this device
am: በዚህ መሳሪያ ላይ ምንም ዱካ አትተዉ

source: Leave private tabs
am: የግል ትሮችን ዝጋ

source: Less
am: ያነሰ

source: Less distractions, less cookies tracking you on this site.
am: ያነሱ ትኩረትን የሚከፋፍሉ፣ በዚህ ጣቢያ ላይ እርስዎን የሚከታተሉ ኩኪዎች ያነሱ ናቸው።

source: Libraries that we use
am: የምንጠቀማቸው ጥቅሎች

source: Library
am: ቤተ መፃህፍት

source: Licensing information
am: የፈቃድ መረጃ

source: Light
am: ፈካ ያለ

source: Light color scheme
am: ፈካ ያለ ቀለም ንድፍ

source: Light theme
am: ፈካ ያለ ጭብጥ

source: Limited Edition
am: የተወሰነ ስሪት

source: Limits the ability of social networks to track your browsing activity around the web.
am: የማህበራዊ አውታረ መረቦች በድር ላይ የአሰሳ እንቅስቃሴዎን ለመከታተል ያላቸውን ችሎታ ይገድባል።

source: Link copied to clipboard
am: አገናኝ ወደ ቅንጥብ ሰሌዳ ተቀድቷል

source: Links
am: አገናኞች

source: Links available
am: የሚገኙ አገናኞች

source: Link shared
am: አገናኝ ተጋርቷል

source: Link sharing
am: አገናኝ ማጋራት

source: List
am: ዝርዝር

source: Loading
am: በመጫን ላይ

source: location
am: ቦታ

source: Location
am: ቦታ

source: Lock tabs
am: ትሮችን ቆልፍ

source: Logging in to %1$s with a %2$s account is subject to their <a href="%3$s">Privacy Policy</a> and <a href="%4$s">Terms of Service</a>
am: በ%2$s መለያ ወደ %1$s መግባት በ<a href="%3$s">የግላዊነት ፖሊሲ</a> እና <a href="%4$s">የአገልግሎት ውል</a> ተገዢ ነው

source: Login detail menu
am: የመግቢያ ዝርዝር ምናሌ

source: Login options
am: የመግቢያ አማራጮች

source: Logins
am: መግቢያዎች

source: Logins and passwords
am: መግቢያዎች እና የይለፍ ቃሎች

source: Logins and passwords that are not saved will be shown here.
am: ያልተቀመጡ መግቢያዎች እና የይለፍ ቃሎች እዚህ ይታያሉ።

source: Logins and passwords will not be saved for these sites.
am: ለእነዚህ ድረ-ገፆች መግቢያዎች እና የይለፍ ቃሎች አይቀመጡም።

source: Looks like there’s a problem with your internet connection
am: የበይነመረብ ግንኙነትዎ ላይ ችግር ያለ ይመስላል

source: Make %1$s your default
am: %1$s ነባሪ ያድርጉት

source: Make Firefox your default browser
am: Firefoxን ነባሪ አሳሽዎ ያድርጉ

source: Make Firefox your go-to browser
am: ፋየርፎክስን ነባሪ አሳሽዎ ያድርጉ

source: Make sure you trust this site before you upload from “%1$s”.
am: ከ“%1$s” ከመስቀልዎ በፊት ይህን ጣቢያ ማመንዎን ያረጋግጡ።

source: Make %s your go-to browser
am: %sን ነባሪ አሳሽዎ ያድርጉ

source: Make %s your own
am: %s የራስዎ ያድርጉት

source: Make text on websites larger or smaller
am: በድረ-ገጾች ላይ ፅሑፎችን ትልልቅ ወይም ትንንሽ ያድርጉ

source: Malware site issue
am: ጎጂ ድረ-ገጽ ችግር

source: Manage
am: አስተዳድር

source: Manage account
am: መለያ ያስተዳድሩ

source: Manage addresses
am: አድራሻዎችን ያስተዳድሩ

source: Manage alternative search engines
am: አማራጭ የፍለጋ ፍርግሞችን ያቀናብሩ

source: Manage cards
am: ካርዶችን ያስተዳድሩ

source: Manage credit cards
am: ክሬዲት ካርዶችን ያስተዳድሩ

source: Manage downloads with another app
am: ውርዶችን በሌላ መተግበሪያ ያስተዳድሩ

source: Manage extensions
am: ቅጥያዎችን ያስተዳድሩ

source: Manage Files
am: ፋይሎችን አስተዳድር

source: Manage logins
am: መግቢያዎችን ያስተዳድሩ

source: Manage passwords
am: የይለፍ ቃሎችን አስተዳድር

source: Manage saved cards
am: የተቀመጡ ካርዶችን ያስተዳድሩ

source: Manage search shortcuts
am: የፍለጋ አቋራጮችን ያስተዳድሩ

source: Manage settings
am: ቅንብሮችን ያስተዳድሩ

source: Mar
am: መጋ

source: Marketing
am: ግብይት

source: Marketing data
am: የግብይት ውሂብ

source: Max Protection
am: ከፍተኛ ጥበቃ

source: May
am: ግን

source: Media
am: ሚዲያ

source: Meet your personalized homepage. Recent tabs, bookmarks, and search results will appear here.
am: የእርስዎን ግላዊ መነሻ ገጽ ያግኙ። የቅርብ ጊዜ ትሮች፣ እልባቶች እና የፍለጋ ውጤቶች እዚህ ይታያሉ።

source: Microphone
am: ድምፅ ማጉያ

source: Microphone 1
am: ማይክሮፎን 1

source: Microphone is on
am: ማይክሮፎን በርቷል

source: Middle Name
am: የአባት ስም

source: Midnight
am: እኩለ ሌሊት

source: Minimal
am: ዝቅተኛ

source: Missing content
am: የተጓደለ ይዘት

source: Mix of reliable and unreliable reviews
am: አስተማማኝ እና የማይታመኑ ግምገማዎች ድብልቅ

source: Momo
am: ሞሞ

source: Monitor extension usage and manage themes
am: የቅጥያ አጠቃቀምን ይቆጣጠሩ እና ገጽታዎችን ያስተዳድሩ

source: More about this add-on
am: ስለዚህ ተጨማሪ የበለጠ መረጃ

source: More about this extension
am: ስለዚህ ቅጥያ የበለጠ መረጃ

source: More colors. Better privacy. Same commitment to people over profits.
am: ተጨማሪ ቀለሞች። የተሻለ ግላዊነት። ከትርፍ በላይ ለሰዎች ተመሳሳይ ቁርጠኝነት።

source: More options
am: ተጨማሪ አማራጮች

source: More than 100 million people protect their privacy by choosing a browser that’s backed by a nonprofit.
am: ከ100 ሚሊዮን በላይ ሰዎች በትርፍ ያልተቋቋመ አሳሽ በመምረጥ ግላዊነትን ይጠብቃሉ።

source: More to consider
am: ሊታሰብበት የሚገባ ተጨማሪ

source: Most likely, the website simply does not support HTTPS.
am: ምናልባት፣ ድረ-ገጹ በቀላሉ HTTPSን አይደግፍም።

source: Move
am: አንቀሳቅስ

source: Move old tabs to inactive
am: የቆዩ ትሮችን ወደ እንቅስቃሴ-አልባ ውሰድ

source: Move to non-private tab
am: ወደ የግል ያልሆነ ትር ይሂዱ

source: Mozilla account/Sync server modified. Quitting the application to apply changes…
am: የMozilla መለያ/አመሳስል አገልጋይ ተቀይሯል። ለውጦችን ለመተግበር መተግበሪያውን በማቆም ላይ…

source: Must be a valid domain
am: ልክ የሆነ ጎራ መሆን አለበት

source: Must have a title
am: ርዕስ ሊኖረው ይገባል

source: NAME
am: ስም

source: Name (A-Z)
am: ስም (ሀ-ፐ)

source: Name collection
am: የስም ስብስብ

source: Name on Card
am: በካርዱ ላይ ያለው ስም

source: Navigate back
am: ወደ ኋላ ዳስስ

source: Navigate up
am: ወደ ላይ አስስ

source: Neutral
am: ገለልተኛ

source: Never
am: በፍጹም

source: Never save
am: በጭራሽ አታስቀምጥ

source: Never send
am: በጭራሽ አትላክ

source: Never show again
am: ዳግም አታሳይ

source: Never translate
am: በጭራሽ አትተረጎም

source: Never translate %1$s
am: %1$sን በጭራሽ አትተርጉም

source: Never translate these sites
am: እነዚህን ጣቢያዎች በጭራሽ አትተርጉም

source: Never translate this site
am: ይህን ጣቢያ በጭራሽ አትተርጉም

source: New add-on available
am: አዲስ ተጨማሪ አለ

source: New add-ons available
am: አዲስ ተጨማሪዎች አሉ

source: New add-ons now available
am: አዲስ ተጨማሪዎች አሁን ይገኛሉ

source: New data collection:
am: አዲስ መረጃ መሰብሰብ፡-

source: New extensions now available
am: አዲስ ቅጥያዎች አሁን ይገኛሉ

source: New folder
am: አዲስ አቃፊ

source: New in %1$s
am: በ%1$s ውስጥ አዲስ

source: New info to check
am: ለመፈተሽ አዲስ መረጃ

source: New: one-tap back and forward arrows
am: አዲስ፡- አንድ ጊዜ መታ ወደ ኋላ እና ወደፊት ቀስቶች

source: New permissions:
am: አዲስ ፈቃዶች፡-

source: New private tab
am: አዲስ የግል ትር

source: New private tab opened
am: አዲስ የግል ትር ተከፍቷል

source: New: streamlined menu
am: አዲስ፡- የተሳለጠ ምናሌ

source: New tab
am: አዲስ ትር

source: New tab opened
am: አዲስ ትር ተከፍቷል

source: No account? <u>Create one</u> to sync Firefox between devices.
am: መለያ የለም? ፋየርፎክስን በመሳሪያዎች መካከል ለማመሳሰል <u>አንድ ይፍጠሩ</u>።

source: No add-ons here
am: እዚህ ምንም ተጨማሪዎች የሉም

source: No app found to open %1$s files
am: %1$s ፋይሎችን የሚከፍት ምንም መተግበሪያ አልተገኘም

source: No bookmarks here
am: እዚህ ምንም እልባቶች የሉም

source: No bookmarks yet
am: እስካሁን ምንም ዕልባቶች የሉም

source: No camera available on device
am: በመሳሪያው ላይ ምንም ካሜራ የለም

source: No crash reports have been submitted.
am: ምንም የብልሽት ሪፖርቶች አልገቡም።

source: No Devices Connected
am: ምንም መሣሪያዎች አልተገናኙም

source: No downloaded files
am: ምንም የወረዱ ፋይሎች የሉም

source: No downloads yet
am: እስካሁን ምንም ማውረድ የለም

source: No experiments here
am: እዚህ ምንም ሙከራዎች የሉም

source: No extensions enabled
am: ምንም ቅጥያዎች አልነቁም

source: No extensions here
am: እዚህ ምንም ቅጥያዎች የሉም

source: No history here
am: እዚህ ምንም ታሪክ የለም

source: No info about these reviews yet
am: ስለእነዚህ ግምገማዎች እስካሁን ምንም መረጃ የለም

source: No info available right now
am: አሁን ምንም መረጃ የለም

source: No internet connection
am: ምንም የበይነመረብ ግንኙነት የለም

source: No network connection
am: ምንም የአውታረ መረብ ግንኙነት የለም

source: Non-private Tabs Open: %1$s. Tap to switch tabs.
am: የግል ያልሆኑ ትሮች ተከፍተዋል፡ %1$s። ትሮችን ለመቀየር መታ ያድርጉ።

source: No open tabs
am: ምንም ክፍት ትሮች የሉም

source: No recently closed tabs here
am: በቅርብ ጊዜ የተዘጉ ትሮች እዚህ የሉም

source: No results found
am: ምንም ውጤቶች አልተገኙም

source: Northern Lights
am: ሰሜናዊ ብርሃን

source: No site exceptions
am: ምንም የተለየ ድረ-ገፅ የለም

source: Not allowed
am: አልተፈቀደም

source: Not allowed in private windows
am: በግል መስኮቶች ውስጥ አይፈቀድም

source: Not enough reviews yet
am: እስካሁን በቂ ግምገማዎች የሉም

source: Not enough space
am: በቂ ቦታ የለም

source: No thanks
am: አልፈልግም፣አመሰግናለሁ

source: Notification
am: ማሳወቂያ

source: Notifications
am: ማሳወቂያዎች

source: Notifications for tabs received from other Firefox devices.
am: ከሌሎች የፋየርፎክስ መሳሪያዎች የተቀበሉት የትሮች ማሳወቂያዎች።

source: Notifications help you do more with Firefox
am: ማሳወቂያዎች በፋየርፎክስ የበለጠ እንዲሰሩ ያግዝዎታል

source: Notifications help you do more with %s
am: ማሳወቂያዎች በ%s የበለጠ እንዲሰሩ ያግዝዎታል

source: Notifications help you stay safer with Firefox
am: ማሳወቂያዎች በFirefox ደህንነትዎ እንደተጠበቀ እንዲቆዩ ያግዝዎታል

source: Not now
am: አሁን አይሆንም

source: Not Now
am: አሁን አይሆንም

source: No trackers found
am: ምንም መከታተያዎች አልተገኙም

source: Not secure
am: ደህንነቱ የተጠበቀ አይደለም

source: Not yet available
am: እስካሁን አልተገኘም

source: Not yet supported
am: እስካሁን አልተደገፈም

source: No update available
am: ምንም ዝማኔ የለም

source: (No username)
am: (የተጠቃሚ ስም የለም)

source: Nov
am: ሕዳ

source: Now featuring Total Cookie Protection, our most powerful barrier yet against cross-site trackers.
am: አሁን አጠቃላይ የኩኪ ጥበቃን በማሳየት ላይ፣ የኛ እጅግ ኃይለኛው ድረ-ገጽ ተሻጋሪ መከታተያዎችን አጋጅ።

source: Oct
am: ጥቅ

source: Offer to translate (default)
am: ለመተርጎም አቅርብ (ነባሪ)

source: Offer to translate when possible
am: ሲቻል ለመተርጎም አቅርብ

source: Off for this site
am: ለዚህ ድረ-ገፅ ጠፍቷል

source: Offline
am: ከመስመር ውጭ

source: Offline Mode
am: ከመስመር ውጭ ሁነታ

source: OK
am: እሺ

source: Okay, Got it
am: እሺ ገባኝ

source: OK, Got It
am: እሺ፣ ገባኝ

source: Older
am: ይበልጥ የቆየ

source: On a website, this bar tucks away as you scroll down for extra browsing space.
am: በድር ጣቢያ ላይ፣ ለተጨማሪ የአሰሳ ቦታ ወደ ታች ሲያሸብልሉ ይህ አሞሌ ይዘጋል።

source: One last thing
am: አንድ የመጨረሻ ነገር

source: One or more add-ons stopped working, making your system unstable.
am: አንድ ወይም ከዚያ በላይ ተጨማሪዎች መስራት አቁመዋል፣ ይህም ስርዓትዎ ያልተረጋጋ እንዲሆን አድርጎታል።

source: One or more add-ons stopped working, making your system unstable. %1$s unsuccessfully tried to restart the add-on(s). Add-ons won’t be restarted during your current session. Removing or disabling add-ons may fix this issue.
am: አንድ ወይም ከዚያ በላይ ተጨማሪዎች መስራት አቁመዋል፣ይህም ስርዓትዎ ያልተረጋጋ እንዲሆን አድርጎታል። %1$s ተጨማሪውን እንደገና ለማስጀመር ሞክሯል አልተሳካም። ተጨማሪዎች በአሁኑ ክፍለ ጊዜዎ እንደገና አይጀመሩም። ተጨማሪዎችን ማስወገድ ወይም ማሰናከል ይህንን ችግር ሊፈታው ይችላል።

source: One or more extensions stopped working, making your system unstable.
am: አንድ ወይም ከዚያ በላይ ቅጥያዎች መስራት አቁመዋል፣ ይህም ስርዓትዎ ያልተረጋጋ እንዲሆን አድርጎታል።

source: One or more extensions stopped working, making your system unstable. %1$s unsuccessfully tried to restart the extension(s). Extensions won’t be restarted during your current session. Removing or disabling extensions may fix this issue.
am: አንድ ወይም ከዚያ በላይ ቅጥያዎች መስራት አቁመዋል፣ ይህም ስርዓትዎ ያልተረጋጋ እንዲሆን አድርጎታል። %1$s ቅጥያውን(ዎችን) እንደገና ለማስጀመር ሞክሮ አልተሳካም። ቅጥያዎች አሁን ባለው ክፍለ ጊዜዎ እንደገና አይጀመሩም። ቅጥያዎችን ማስወገድ ወይም ማሰናከል ይህንን ችግር ሊፈታው ይችላል።

source: On for this site
am: ለዚህ ድረ-ገፅ በርቷል

source: On in all tabs
am: በሁሉም ትሮች ውስጥ በርቷል

source: On in private tabs
am: በግል ትሮች ውስጥ በርቷል

source: Only in Private tabs
am: በግል ትሮች ውስጥ ብቻ

source: Only use the provider you select
am: የመረጡትን አገልግሎት አቅራቢ ብቻ ይጠቀሙ

source: Only use your default DNS resolver if there is a problem with secure DNS
am: ደህንነቱ በተጠበቀ DNS ላይ ችግር ካለ ብቻ ነባሪውን የ DNS መፍታት ይጠቀሙ

source: On your computer open Firefox and go to <b>https://firefox.com/pair</b>
am: በኮምፒተርዎ ላይ Firefox ን ይክፈቱ እና ወደ <b>https://firefox.com/pair</b> ይሂዱ

source: Open
am: ክፈት

source: Open all in new tabs
am: ሁሉንም በአዲስ ትሮች ውስጥ ይክፈቱ

source: Open all in private tabs
am: ሁሉንም በግል ትሮች ውስጥ ይክፈቱ

source: Open a new %1$s tab
am: አዲስ %1$s ትር ክፈት

source: Open debug drawer
am: የማረም መሳቢያን ይክፈቱ

source: Open %d tabs?
am: %d ትሮች ይከፈቱ?

source: Open files downloaded to your device
am: ወደ መሳሪያዎ የወረዱ ፋይሎችን ይክፈቱ

source: Open image in new tab
am: ምስሉን በአዲስ ትር ውስጥ ክፈት

source: Open in…
am: ክፈት በ…

source: Open in %1$s
am: በ %1$s ክፈት

source: Open in another app
am: በሌላ መተግበሪያ ውስጥ ክፈት

source: Open in app
am: በመተግበሪያ ውስጥ ክፈት

source: Open in app? Your activity may no longer be private.
am: በመተግበሪያ ውስጥ ክፈት? እንቅስቃሴዎ ከአሁን በኋላ ግላዊ ላይሆን ይችላል።

source: Opening screen
am: የመክፈቻ ማያ

source: Opening this many tabs may slow down %s while the pages are loading. Are you sure you want to continue?
am: ይህን ብዙ ትሮች መክፈት ገጾቹ በሚጫኑበት ጊዜ %sን ሊያዘገየው ይችላል። እርግጠኛ ነዎት መቀጠል ይፈልጋሉ?

source: Open in new tab
am: በአዲስ ትር ክፈት

source: Open in private tab
am: በግል ትር ክፈት

source: Open in regular tab
am: በመደበኛ ትር ውስጥ ይክፈቱ

source: Open in %s
am: በ%s ውስጥ ክፈት

source: Open in %s? Your activity may no longer be private.
am: በ%s ውስጥ ይከፈት? እንቅስቃሴዎ ከአሁን በኋላ ግላዊ ላይሆን ይችላል።

source: Open it in the menu
am: በምናሌው ውስጥ ይክፈቱት

source: Open link in external app
am: አገናኙን በሌላ መተግበሪያ ውስጥ ክፈት

source: Open link in new tab
am: አገናኙን በአዲስ ትር ውስጥ ክፈት

source: Open link in private tab
am: አገናኙን በግል ትር ውስጥ ክፈት

source: Open links in apps
am: አገናኞችን በመተግበሪያዎች ውስጥ ክፈት

source: Open links in a private tab
am: አገናኞችን በግል ትር ውስጥ ክፈት

source: open link to learn more
am: የበለጠ ለማወቅ አገናኝ ይክፈቱ

source: open link to learn more about this collection
am: ስለዚህ ስብስብ የበለጠ ለማወቅ አገናኝ ይክፈቱ

source: Open on homepage
am: መነሻ ገጽ ላይ ክፈት

source: Open on homepage after four hours
am: ከአራት ሰዓታት በኋላ በመነሻ ገጽ ላይ ክፈት

source: Open on last tab
am: በመጨረሻው ትር ላይ ይክፈቱ

source: Open review checker
am: የግምገማ አረጋጋጭን ይክፈቱ

source: Open site in browser
am: ድረ-ገፅን በአሳሽ ውስጥ ይክፈቱ

source: Open survey
am: ዳሰሳ ጥናት ክፈት

source: Open tabs
am: ትሮችን ክፈት

source: Open tabs menu
am: የትሮች ምናሌን ይክፈቱ

source: Optional
am: አማራጭ

source: Optional data collection:
am: አማራጭ መረጃ መሰብሰብ፡-

source: Optional permissions:
am: አማራጭ ፈቃዶች፡-

source: Optional settings:
am: አማራጭ ቅንብሮች፡-

source: Original untranslated page loaded
am: ዋናው ያልተተረጎመ ገጽ ተጭኗል

source: Other Bookmarks
am: ሌሎች እልባቶች

source: Others
am: ሌሎች

source: Our most powerful privacy feature yet isolates cross-site trackers.
am: የእኛ በጣም ኃይለኛ የግላዊነት ባህሪ ግን የድረ-ገጽ ተሻጋሪ መከታተያዎችን ያገላል።

source: Our non-profit backed browser helps stop companies from secretly following you around the web.
am: የእኛ ለትርፍ-ባልተቋቋመ የሚደገፈው አሳሽ ኩባንያዎች በድር ላይ እርስዎን በድብቅ እንዳይከተሉዎት ያግዛል።

source: Our non-profit backed browser helps stop companies from secretly following you around the web. Learn more in our privacy notice.
am: የእኛ ለትርፍ-ባልተቋቋመ የሚደገፈው አሳሽ ኩባንያዎች እርስዎን በድር ላይ በድብቅ እንዳይከተሉዎ ያግዛል። በግላዊነት ማስታወቂያችን ላይ የበለጠ ይረዱ።

source: Our sponsors & your privacy
am: የእኛ ስፖንሰሮች እና የእርስዎ ግላዊነት

source: Override current region
am: የአሁኑን ክልል ይሻሩ

source: Override home and current region
am: የቤት እና የአሁኑን ክልል ይሽሩ

source: Override home region
am: የቤት ክልልን ይሻሩ

source: Override home region permanently
am: የቤት ክልልን በቋሚነት ይሻሩ

source: Overrides all other settings
am: ሁሉንም ሌሎች ቅንብሮችን ይሽራል

source: Overrides offers to translate
am: የመተርጎም ቅናሾችን ይሽራል

source: Packaging and appearance
am: ማሸጊያ እና ገፅታ

source: <p>Additional information about this problem or error is currently unavailable.</p>
am: <p>ስለዚህ ችግር ወይም ስህተት ተጨማሪ መረጃ በአሁኑ ጊዜ አይገኝም።</p>

source: Pages will load normally, but block fewer trackers.
am: ገጾች በመደበኛነት ይጫናሉ፣ ነገር ግን ጥቂት መከታተያዎችን ያግዳል።

source: Page translated from %1$s to %2$s
am: ገጽ ከ%1$s ወደ %2$s ተተርጉሟል

source: Page translated from %1$s to %2$s.
am: ገጽ ከ%1$s ወደ %2$s ተተርጉሟል።

source: Part of the Firefox family. %s
am: የፋየርፎክስ ቤተሰብ አካል። %s

source: Password
am: የይለፍ ቃል

source: Password copied to clipboard
am: የይለፍ ቃል ወደ ቅንጥብ ሰሌዳ ተቀድቷል

source: Password field must not be empty
am: የይለፍ ቃል ባዶ መሆን የለበትም

source: Password for %1$s
am: የይለፍ ቃል ለ%1$s

source: Password options
am: የይለፍ ቃል አማራጮች

source: Password required
am: የይለፍ ቃል ያስፈልጋል

source: Passwords
am: የይለፍ ቃሎች

source: Password saved
am: የይለፍ ቃል ተቀምጧል

source: Passwords shortcut
am: የይለፍ ቃላት አቋራጭ

source: Password updated
am: የይለፍ ቃል ዘምኗል

source: Paste
am: ለጥፍ

source: Paste & Go
am: ለጥፍ እና ሂድ

source: Pause
am: ለአፍታ አቁም

source: paused
am: ለአፍታ ቆሟል

source: Payment methods
am: የክፍያ ዘዴዎች

source: pending
am: በመጠባበቅ ላይ

source: Permissions
am: ፈቃዶች

source: Persistent Storage
am: ቋሚ ማከማቻ

source: personal communications
am: የግል ግንኙነቶች

source: personally identifying information
am: የግል መለያ መረጃ

source: Phone
am: ስልክ

source: Pick a month
am: አንድ ወር ይምረጡ

source: Pick a theme
am: ጭብጥ ይምረጡ

source: Pick a toolbar placement
am: የመሳሪያ አሞሌ አቀማመጥ ይምረጡ

source: Pick up where you left off with tabs from other devices now on your homepage.
am: ከሌሎች መሳሪያዎች ትሮች ካቆሙበት አሁን በመነሻ ገጽዎ ላይ ይምረጡ።

source: Pick your toolbar placement
am: የመሳሪያ አሞሌ አቀማመጥ ይምረጡ

source: Pixelated
am: በፒክሰል የተሰራ

source: Play
am: አጫውት

source: Please choose a reason
am: እባክዎ ምክንያት ይምረጡ

source: Please complete survey
am: እባክዎ የዳሰሳ ጥናት ያጠናቅቁ

source: Please enable tab syncing.
am: እባክዎ የትር ማመሳሰልን ያንቁ።

source: Please enter a number greater than zero
am: እባክዎ ከዜሮ በላይ የሆነ ቁጥር ያስገቡ

source: Please enter a valid credit card number
am: እባክዎ የሚሰራ የክሬዲት ካርድ ቁጥር ያስገቡ

source: Please enter a valid URL
am: አባክዎ የሚሰራ URL ያስገቡ

source: Please enter positive integers only
am: እባክዎ አዎንታዊ አሃዝ ብቻ ያስገቡ

source: Please fill out this field
am: እባክዎ ይህንን መስክ ይሙሉ

source: Please help make Firefox better by taking a short survey.
am: እባኮትን አጭር ዳሰሳ በማድረግ ፋየርፎክስን የተሻለ ለማድረግ ያግዙ።

source: Please re-authenticate.
am: እባክዎ እንደገና ያረጋግጡ።

source: Port restricted for security reasons
am: ለደህንነት ሲባል ወደብ ተገድቧል

source: Powered by %1$s
am: በ%1$s የተጎላበተ

source: POWERED BY %1$s
am: በ%1$s የተጎላበተ

source: Powered by %s.
am: በ%s የተጎላበተ።

source: Preparing download…
am: ማውረድን በማዘጋጀት ላይ…
